dotfiles/.config/doom/config.org
#+TITLE: Org-Mode Literate Config
#+STARTUP: showeverything

* HOW TO USE
- ~org-babel-load-file~ this file
#+begin_src emacs-lisp
;;; package --- This is for the configuration
;;; Commentary:
;;; Code:
#+end_src

#+RESULTS:

* PERSONAL INFORMATION
#+begin_src emacs-lisp
(setq user-full-name "Kadoi Takemaru"
      user-mail-address "diohabara@gmail.com")
#+end_src

#+RESULTS:
: diohabara@gmail.com

* PATH
Adding paths for LaTeX

#+begin_src emacs-lisp
(setenv "PATH" (concat "/Library/TeX/texbin" (getenv "PATH")))
(setq exec-path (append '("/Library/TeX/texbin") exec-path))
#+end_src

#+RESULTS:
| /Library/TeX/texbin | /Library/TeX/texbin/latex | /Library/TeX/texbin/dvipng | /Library/TeX/texbin | /Users/jio/.cabal/bin/ | /Users/jio/.ghcup/bin/ | /Users/jio/.cabal/bin/ | /Users/jio/.ghcup/bin/ | /Users/jio/.cargo/bin/ | /Users/jio/.poetry/bin/ | /Users/jio/.pyenv/shims/ | /Users/jio/.pyenv/bin/ | /usr/local/opt/llvm/bin/ | /usr/local/bin/ | /usr/local/bin/ | /usr/bin/ | /bin/ | /usr/sbin/ | /sbin/ | /usr/local/share/dotnet/ | ~/.dotnet/tools/ | /Users/jio/.local/bin/ |

* DOOM THEME
#+begin_src emacs-lisp
(setq doom-theme 'doom-one)
#+end_src

#+RESULTS:
: doom-one


* BETTER DEFAULT
#+begin_src emacs-lisp
(setq org-directory "~/org/")
(setq display-line-numbers-type 'relative)
#+end_src

#+RESULTS:
: relative
* FONTS
#+begin_src emacs-lisp
(setq doom-font (font-spec :family "JetBrains Mono" :size 15)
      doom-unicode-font (font-spec :family "Noto Serif CJK JP" :size 15)
      doom-big-font (font-spec :family "JetBrains Mono" :size 18)
      doom-variable-pitch-font (font-spec :family "JetBrains Mono" :size 18)
      doom-serif-font (font-spec :family "JetBrains Mono" :weight 'light))
#+end_src

#+RESULTS:
: #<font-spec nil nil JetBrains\ Mono nil nil light nil nil nil nil nil nil nil>

* ORG MODE
** DESIGN
#+begin_src emacs-lisp
(after! org
  (setq org-superstar-headline-bullets-list '("⁖" "◉" "○" "✸" "✿"))
  )
#+end_src

#+RESULTS:
| ⁖ | ◉ | ○ | ✸ | ✿ |
** ORG-TREE-SLIDE
- While using org-tree-slide
  + you can go to a previous page by ~<f9>~
  + you can go to a next page by ~<f10>~.
#+begin_src emacs-lisp
(when (require 'org-tree-slide nil t)
  (define-key org-tree-slide-mode-map (kbd "<f9>")
    'org-tree-slide-move-previous-tree)
  (define-key org-tree-slide-mode-map (kbd "<f10>")
    'org-tree-slide-move-next-tree)
  (define-key org-tree-slide-mode-map (kbd "<f11>")
    'org-tree-slide-content)
  )
#+end_src

#+RESULTS:
: org-tree-slide-content

* MONITORING
#+begin_src emacs-lisp
(use-package! wakatime-mode
  :ensure t
  :when (file-exists-p "~/.wakatime.cfg")
  :init
  (global-wakatime-mode))
#+end_src

#+RESULTS:
: wakatime-mode

* PROGRAMMING LANGUAGE
** Common Lisp
First thing you need to do is type ~M-x slime~. You will start ~slime~ process, and you can interactively evaluate expressions and files.
- ~C-c C-C~: evaluate an expression
- ~C-c C-k~: evaluate a file
- ~C-c C-z~: display a REPL buffer
#+begin_src emacs-lisp
(setq inferior-lisp-program "/usr/local/bin/sbcl")
#+end_src
* REFERENCES
- [[http://dev.ariel-networks.com/wp/archives/462]]

* EOF
#+begin_src emacs-lisp
(provide 'config)
;;; config.el ends here
#+end_src

#+RESULTS:
: config
